Белгипрозем_2017/src/Documents/мПродлениеСроков/мПродлениеСроков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мПродлениеСроков</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сроки</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерДС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПродлитьДо</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мПродлениеСроков/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мПродлениеСроковСроки.Ссылка.Дата КАК Дата,
		|	мПродлениеСроковСроки.Договор,
		|	мПродлениеСроковСроки.ЭтапДоговора,
		|	мПродлениеСроковСроки.НомерДС,
		|	мПродлениеСроковСроки.ДатаДС,
		|	мПродлениеСроковСроки.ПродлитьДо,
		|	мПродлениеСроковСроки.ВидДокумента,
		|	мПродлениеСроковСроки.Ссылка.Ответственный КАК Ответственный,
		|	мПродлениеСроковСроки.ЭтапДоговора.ЗапретИзмененияПлановогоСрока КАК ЗапретИзмененияПлановогоСрока
		|ИЗ
		|	Документ.мПродлениеСроков.Сроки КАК мПродлениеСроковСроки
		|ГДЕ
		|	мПродлениеСроковСроки.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Результат = Запрос.Выполнить();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаСроки", Результат.Выгрузить());
	
КонецПроцедуры
